Repository: mmaudet/CAAL
Catalog: mobile/lib/l10n/app_*.arb
Languages: fr, it

# welcomeSubtitle
source: Chat live with your voice AI agent
fr: Discutez en direct avec votre assistant vocal IA
it: Chatta in diretta con il tuo assistente vocale IA

# talkToAgent
source: Talk to CAAL
fr: Parler à CAAL
it: Parla con CAAL

source: Connecting
fr: Connexion
it: Connessione

# agentListening
source: CAAL is listening
fr: CAAL écoute
it: CAAL sta ascoltando

source: Agent is listening
fr: L'agent écoute
it: L'agente sta ascoltando

# startConversation
source: Start a conversation to see messages here.
fr: Commencez une conversation pour voir les messages ici.
it: Inizia una conversazione per vedere i messaggi qui.

# sayWakeWord
source: Say "Hey Jarvis"
fr: Dites "Hey Jarvis"
it: Di' "Hey Jarvis"

source: Waiting for wake word...
fr: En attente du mot d'activation...
it: In attesa della parola di attivazione...

source: Screenshare View
fr: Vue du partage d'écran
it: Vista condivisione schermo

source: Settings
fr: Paramètres
it: Impostazioni

# settingsTitle
source: Settings
fr: Paramètres
it: Impostazioni

source: CAAL Setup
fr: Configuration CAAL
it: Configurazione CAAL

source: Save
fr: Enregistrer
it: Salva

source: Saving...
fr: Enregistrement...
it: Salvataggio...

source: Test
fr: Tester
it: Testa

source: CONNECT
fr: CONNECTER
it: CONNETTI

source: Connection
fr: Connexion
it: Connessione

source: Server URL
fr: URL du serveur
it: URL del server

# serverUrlRequired
source: Server URL is required
fr: L'URL du serveur est requise
it: L'URL del server è richiesto

# serverUrlInvalid
source: Enter a valid URL
fr: Entrez une URL valide
it: Inserisci un URL valido

# yourServerAddress
source: Your CAAL server address
fr: L'adresse de votre serveur CAAL
it: L'indirizzo del tuo server CAAL

# connectedToServer
source: Connected to CAAL server
fr: Connecté au serveur CAAL
it: Connesso al server CAAL

# enterServerFirst
source: Enter a valid server URL first
fr: Entrez d'abord une URL de serveur valide
it: Inserisci prima un URL del server valido

# serverReturned
source: Server returned {code}
fr: Le serveur a renvoyé {code}
it: Il server ha restituito {code}

# couldNotConnect
source: Could not connect to server
fr: Impossible de se connecter au serveur
it: Impossibile connettersi al server

# couldNotReach
source: Could not reach server
fr: Impossible d'atteindre le serveur
it: Impossibile raggiungere il server

# completeWizardFirst
source: Complete the first-start wizard in your browser first
fr: Complétez d'abord l'assistant de démarrage dans votre navigateur
it: Completa prima la configurazione guidata nel browser

# enterServerToStart
source: Enter your server address to get started
fr: Entrez l'adresse de votre serveur pour commencer
it: Inserisci l'indirizzo del tuo server per iniziare

# completeWizardHint
source: Complete the first-start wizard in your browser, then connect here.
fr: Complétez l'assistant de démarrage dans votre navigateur, puis connectez-vous ici.
it: Completa la configurazione guidata nel browser, poi connettiti qui.

# connectToServerFirst
source: Connect to server to configure agent settings
fr: Connectez-vous au serveur pour configurer les paramètres de l'agent
it: Connettiti al server per configurare le impostazioni dell'agente

source: Agent
it: Agente

source: Agent Name
fr: Nom de l'agent
it: Nome dell'agente

source: Wake Greetings
fr: Messages d'accueil
it: Messaggi di benvenuto

# onePerLine
source: One greeting per line
fr: Un message par ligne
it: Uno per riga

source: Providers
fr: Fournisseurs
it: Fornitori

source: LLM Provider
fr: Fournisseur LLM
it: Fornitore LLM

# ollamaLocalPrivate
source: Local, private
fr: Local, privé
it: Locale, privato

# groqFastCloud
source: Fast cloud
fr: Cloud rapide
it: Cloud veloce

source: Ollama Host
fr: Hôte Ollama
it: Host Ollama

source: API Key
fr: Clé API
it: Chiave API

source: Model
fr: Modèle
it: Modello

# modelsAvailable
source: {count} models available
fr: {count} modèles disponibles
it: {count} modelli disponibili

# apiKeyConfigured
source: API key configured (enter new key to change)
fr: Clé API configurée (entrez une nouvelle clé pour changer)
it: Chiave API configurata (inseriscine una nuova per cambiare)

source: Connection failed
fr: Échec de la connexion
it: Connessione fallita

source: Failed to connect
fr: Échec de la connexion
it: Connessione fallita

source: Failed to validate
fr: Échec de la validation
it: Validazione fallita

source: Invalid API key
fr: Clé API invalide
it: Chiave API non valida

source: TTS Provider
fr: Fournisseur TTS
it: Fornitore TTS

# kokoroGpuNeural
source: GPU neural TTS
fr: TTS neuronal GPU
it: TTS neurale GPU

# piperCpuLightweight
source: CPU lightweight
fr: Léger sur CPU
it: Leggero su CPU

source: Voice
fr: Voix
it: Voce

source: Integrations
fr: Intégrations
it: Integrazioni

source: Host URL
fr: URL de l'hôte
it: URL dell'host

source: Access Token
fr: Jeton d'accès
it: Token di accesso

# connectedEntities
source: Connected - {count} entities
fr: Connecté - {count} entités
it: Connesso - {count} entità

source: Connected
fr: Connecté
it: Connesso

# n8nMcpNote
source: /mcp-server/http will be appended automatically
fr: /mcp-server/http sera ajouté automatiquement
it: /mcp-server/http verrà aggiunto automaticamente

source: LLM Settings
fr: Paramètres LLM
it: Impostazioni LLM

source: Temperature
fr: Température
it: Temperatura

source: Context Size
fr: Taille du contexte
it: Dimensione del contesto

source: Max Turns
fr: Tours maximum
it: Turni massimi

source: Tool Cache
fr: Cache d'outils
it: Cache strumenti

source: Allow Interruptions
fr: Autoriser les interruptions
it: Consenti interruzioni

# interruptAgent
source: Interrupt the agent while speaking
fr: Interrompre l'agent pendant qu'il parle
it: Interrompi l'agente mentre parla

# endpointingDelay
source: Endpointing Delay (s)
fr: Délai de fin (s)
it: Ritardo di fine turno (s)

# endpointingDelayDesc
source: How long to wait after you stop speaking
fr: Temps d'attente après que vous arrêtez de parler
it: Tempo di attesa dopo che smetti di parlare

source: Wake Word
fr: Mot d'activation
it: Parola di attivazione

source: Server-Side Wake Word
fr: Mot d'activation serveur
it: Parola di attivazione lato server

source: Activate with wake phrase
fr: Activer avec la phrase d'activation
it: Attiva con la frase di attivazione

source: Wake Word Model
fr: Modèle de mot d'activation
it: Modello della parola di attivazione

source: Threshold
fr: Seuil
it: Soglia

source: Language
fr: Langue
it: Lingua

# languageFrench
source: Francais
fr: Français
it: Français

# changesNote
source: Note: Model, context size, and wake word changes take effect on next session.
fr: Note : Les changements de modèle, taille du contexte et mot d'activation prennent effet à la prochaine session.
it: Nota: Le modifiche al modello, dimensione del contesto e parola di attivazione avranno effetto alla prossima sessione.

# failedToLoad
source: Failed to load settings: {error}
fr: Échec du chargement des paramètres : {error}
it: Caricamento delle impostazioni fallito: {error}

# failedToSave
source: Failed to save: {error}
fr: Échec de l'enregistrement : {error}
it: Salvataggio fallito: {error}

# failedToSaveAgent
source: Failed to save agent settings: {code}
fr: Échec de l'enregistrement des paramètres de l'agent : {code}
it: Salvataggio delle impostazioni dell'agente fallito: {code}

# downloadingVoice
source: Downloading voice model...
fr: Téléchargement du modèle vocal...
it: Download del modello vocale...

# messageHint
source: Message...
it: Messaggio...

source: Tool Parameters
fr: Paramètres de l'outil
it: Parametri dello strumento

source: STT Provider
fr: Fournisseur STT
it: Fornitore STT

# openaiCompatibleDesc
source: Any OpenAI API
fr: Toute API OpenAI
it: Qualsiasi API OpenAI

# openrouterDesc
source: 200+ models
fr: 200+ modèles
it: 200+ modelli

source: Base URL
fr: URL de base
it: URL di base

source: optional
fr: optionnel
it: opzionale

# openaiApiKeyNote
source: Only needed if the server requires authentication
fr: Nécessaire uniquement si le serveur requiert une authentification
it: Necessaria solo se il server richiede l'autenticazione

source: Search models...
fr: Rechercher des modèles...
it: Cerca modelli...

source: No models found
fr: Aucun modèle trouvé
it: Nessun modello trovato

# testConnectionToSee
source: Test connection to see available models
fr: Testez la connexion pour voir les modèles disponibles
it: Testa la connessione per vedere i modelli disponibili

# speachesLocalStt
source: Local Whisper
fr: Whisper local
it: Whisper locale

# groqWhisperCloud
source: Cloud Whisper
fr: Whisper cloud
it: Whisper cloud

# sttGroqKeyShared
source: Uses the same API key as LLM
fr: Utilise la même clé API que le LLM
it: Usa la stessa chiave API del LLM

# sttGroqKeyNeeded
source: Groq API key required for STT
fr: Clé API Groq requise pour le STT
it: Chiave API Groq richiesta per STT

# timeout
source: Timeout (s)
fr: Délai (s)
